import Navbar from "./components/navbar";
import Card from "./../views/components/Card";
import Footer from "./components/Footer";

import th from "./assets/thai.png"
// import logo from "./assets/Twice.png";
import bg from "./assets/grass.jpg";

const HomeUI = () => {
  return (
    <div
      className="relative bg-fixed bg-cover min-h-screen"
      style={{ backgroundImage: `url(${bg})` }}
    >
      {/* พื้นหลังจาง */}
      <div className="absolute inset-0 bg-black bg-opacity-40" />

      {/* เนื้อหาหลัก */}
      <div className="relative z-10">
        <Navbar/>

        <div className="flex  flex-wrap justify-center items-center p-4">
          <Card
            image={th}
            title="ประเทศไทย"
            description="ประเทศไทย หรือที่เคยรู้จักในชื่อ “สยาม” มีประวัติศาสตร์ยาวนานหลายพันปี เริ่มตั้งแต่ยุคก่อนประวัติศาสตร์ที่มีมนุษย์ตั้งถิ่นฐานในพื้นที่ที่เป็นประเทศไทยในปัจจุบัน มีหลักฐานทางโบราณคดี เช่น เครื่องมือหิน และแหล่งโบราณคดีบ้านเชียง แสดงถึงความเจริญของมนุษย์ในยุคโบราณ

ต่อมาได้เกิดอาณาจักรไทยต่าง ๆ ขึ้น เช่น อาณาจักรสุโขทัย ซึ่งถือว่าเป็นราชอาณาจักรไทยแห่งแรก ก่อตั้งโดยพ่อขุนศรีอินทราทิตย์ และรุ่งเรืองที่สุดในสมัยพ่อขุนรามคำแหงมหาราช ผู้ทรงประดิษฐ์อักษรไทยและส่งเสริมพุทธศาสนา

จากนั้นไทยเข้าสู่ยุคของ อาณาจักรอยุธยา ซึ่งยิ่งใหญ่และดำรงอยู่กว่า 400 ปี มีการติดต่อค้าขายกับต่างชาติ และเป็นศูนย์กลางการปกครองและวัฒนธรรม ก่อนจะล่มสลายจากการรุกรานของพม่าในปี พ.ศ. 2310

หลังจากนั้น สมเด็จพระเจ้าตากสินมหาราช ได้รวบรวมแผ่นดินและตั้งอาณาจักรธนบุรีขึ้น แต่ดำรงอยู่เพียง 15 ปี ก่อนที่ รัชกาลที่ 1 แห่งราชวงศ์จักรี จะสถาปนา กรุงรัตนโกสินทร์ (กรุงเทพฯ) เป็นเมืองหลวงในปี พ.ศ. 2325 นับเป็นจุดเริ่มต้นของประเทศไทยยุคใหม่ภายใต้ราชวงศ์จักรี

ในช่วงปลายรัตนโกสินทร์ ไทยต้องเผชิญแรงกดดันจากชาติตะวันตก แต่สามารถรักษาเอกราชไว้ได้โดยการเจรจาและปฏิรูปประเทศ โดยเฉพาะในสมัย รัชกาลที่ 5 ที่มีการยกเลิกทาสและพัฒนาโครงสร้างพื้นฐานต่าง ๆ

ในปี พ.ศ. 2475 ประเทศไทยเปลี่ยนแปลงการปกครองจากสมบูรณาญาสิทธิราชย์มาเป็น ประชาธิปไตยภายใต้รัฐธรรมนูญ ผ่านการเคลื่อนไหวของกลุ่ม “คณะราษฎร” นับแต่นั้นประเทศได้มีการเปลี่ยนแปลงผู้นำหลายครั้ง รวมถึงการรัฐประหารซ้ำหลายครั้งตลอดศตวรรษที่ 20 และ 21

ในช่วงสงครามโลกครั้งที่ 2 ไทยได้เข้าร่วมในฝ่ายอักษะกับญี่ปุ่น ก่อนจะหันไปสู่ความสัมพันธ์กับฝ่ายสัมพันธมิตรหลังสงครามจบ จากนั้นไทยได้เติบโตทางเศรษฐกิจอย่างต่อเนื่องในช่วงหลังปี 2500 โดยมีบทบาทสำคัญในภูมิภาคเอเชียตะวันออกเฉียงใต้

ประเทศไทยปัจจุบันเป็น ราชอาณาจักรภายใต้รัฐธรรมนูญ มีพระมหากษัตริย์เป็นประมุข โดยมี พระบาทสมเด็จพระวชิรเกล้าเจ้าอยู่หัว (รัชกาลที่ 10) เป็นพระมหากษัตริย์องค์ปัจจุบัน ประเทศไทยยังคงมีบทบาทสำคัญในด้านเศรษฐกิจ การท่องเที่ยว และการเมืองในภูมิภาคเอเชียตะวันออกเฉียงใต้"
           
          />
        </div>
        <Footer />
      </div>
    </div>
  );
};

export default HomeUI;
